import type {QuestionInterface} from "@/entities/questions";

export const QUESTIONS: QuestionInterface[] = [
    {
        question: "Кто ведет уроки? Какой опыт у преподавателей?",
        answer: 'Все преподаватели, которые ведут уроки и живые лекции со студентами, — это действующие специалисты с опытом 5+ лет . Они совмещают преподавание у нас с основной работой над реальными задачами.'
    },
    {
        question: 'Я смогу совмещать учебу с работой? А если я не буду успевать смотреть уроки вовремя — вы меня отчислите?',
        answer: 'Да, это реально. В среднем учёба занимает около 6-8 часов в неделю. Лекции остаются в записи, домашки доступны сразу после просмотра урока — так что ты сможешь проходить обучение в удобном темпе.'
    },
    {
        question: 'Возможно ли полноценно обучиться профессии в онлайн-формате?',
        answer: 'Да. Курс включает все основы тестирования, практику с реальными инструментами, работу с SQL, консолью, мобильными приложениями и подготовку к трудоустройству. Формат полностью покрывает требования рынка для новичков.'
    },
    {
        question: 'Что нужно для обучения на платформе?',
        answer: 'Для прохождения курса нужен ноутбук или ПК — с телефона учиться нельзя. Камера на созвонах с ментором желательна, но не обязательна. \n' +
            'Минимальные требования:\n' +
            'Windows 10×64 / macOS 11+ / актуальный Linux;\n' +
            'Оперативная память: от 4 Гб;\n' +
            'Intel Core i3 3-го поколения;\n' +
            '5 ГБ свободного места;\n' +
            'Интернет от 10 Мбит/с.'
    },
    {
        question: 'Можно ли пройти обучение быстрее?',
        answer: 'Да. Для этого есть тариф «База» — формат самостоятельного обучения. В нём доступны все уроки и задания, но без проверок и сопровождения. Такой тариф можно пройти значительно быстрее — в среднем за 1–1,5 месяца, двигаясь в удобном для себя темпе.'
    },
    {
        question: 'Чем этот курс лучше курса от крупного игрока?',
        answer: 'Небольшие группы, много практики, наставники с реальным опытом, поддержка, помощь с резюме и собеседованием, доступ к материалам и возможность оплачиваемой стажировки. Все это делает обучение более персональным и прикладным.'
    },
    {
        question: 'Можно ли оплатить курс за счёт работодателя?',
        answer: 'Для покупки за счёт компании тебе нужно согласовать возможность корпоративного обучения со своим руководителем. Расскажи ему про курс и как это поможет твоей работе. Если компания заинтересуется, мы поможем подготовить договор и выставим счёт на юридическое лицо.'
    },
    {
        question: 'Можно ли оплатить курс за другого человека?',
        answer: 'Да, это возможно. При оформлении заявки вы просто оставляете свои контактные данные в форме. После этого менеджер свяжется с вами для уточнения деталей оплаты — именно на этом этапе нужно сообщить, что курс покупается для другого человека. Менеджер оформит доступ на нужного ученика.'
    }
]